Revit 2027 API
EnergyDataSettings.IsGlazingShaded Property
Note: This API is now obsolete.
 If this is true, glazing/windows that are auto-created on exterior walls will automatically have a shading device created on their top edge.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[ObsoleteAttribute("Deprecated in Revit 2027 and may be removed in a later version of Revit.")]
public bool IsGlazingShaded { get; set; }
<ObsoleteAttribute("Deprecated in Revit 2027 and may be removed in a later version of Revit.")>
Public Property IsGlazingShaded As Boolean
	Get
	Set
public:
[ObsoleteAttribute(L"Deprecated in Revit 2027 and may be removed in a later version of Revit.")]
property bool IsGlazingShaded {
	bool get ();
	void set (bool value);
}
[<ObsoleteAttribute("Deprecated in Revit 2027 and may be removed in a later version of Revit.")>]
member IsGlazingShaded : bool with get, set
Property Value
Boolean
See Also
Reference
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace